<a href="TAIL"><img src="https://i.imgur.com/GRTE0OG.png" width="150" title="Tail Logo" />
 </a>

# <font color ="#00b8ff">Aula 1 - Trainees 2</font>

Nome: Luigi Emanuel Martins Schmitt

### Notebook Criado por Rodrigo Veríssimo

## Introdução

O Pandas é uma biblioteca do Python que facilita (e muito) a manipulação de CSVs, arquivos separados por vírgula, que podem ser interpretados como tabelas. Exitem outras duas formas para analisar arquivos CSVs, com métodos nativos e com a biblioteca CSV, mas ambas são poucos práticas para esse intuito.

O código importa a biblioteca pandas e "apelida" ela de "pd", essa é uma convenção amplamente utilizada.

Vamos então iniciar umas manipulações básicas sobre o análise de dados e o que vimos em aula.

Quando passar na ala de código basta apertar o play para rodar

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
students = pd.read_csv("data/q1_estudantes.csv")
climate = pd.read_csv("data/q2_clima.csv")
spotify = pd.read_csv("data/q3_spotify.csv", encoding='ISO-8859-1')

df = students

A função `read_csv()` é chamada e recebe como argumento o endereço de um arquivo CSV, essa função pega esse CSV e transforma ele em um DataFrame (Tabela do Pandas) e atribui à variável data.

In [105]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

A função `.head()` e `.tail()` são responsaveis por verem o inicio (head) ou o final (tail) de uma planilha sem precisar ver toda a tabela de uma vez, alem de pode escolher quantas linhas você deseja ver, no caso do exemplo, 5 linhas. <br>

> Essa função pode ser usada para dividir a tabela em partes menores

Sem nenhum mistério, esse é o grande intuito do Pandas, mexer com tabelas. Lembre-se que uma das grandes aplicações do Python é a ciência de dados, então entender o Pandas vai te tornar um(a) grande programador(a) em Python.
E a partir desses dados tratados você pode realizar alguns métodos para inteligência artificial.

Vamos testar a função `.tail()` ? mostre as 10 ultimas colunas do dataset.

In [106]:
df.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## Analisando o DataSet

Teoria pode ser muito cansativo, então vamos colocar um pouco de prática aqui, você vai fazer um interessante trabalho de estatístico(a).
Explore os dados e tire suas conclusões sobre as colunas, relevância que elas têm, pra que podem ser usadas, etc.

### Dimensionando a tabela

Ok, temos a tabela na variável data mas não sabemos algumas de suas características fundamentais, como tamanho, colunas etc.

Comece dimensionando o DataFrame, diga quantas linhas e colunas ele têm, recomendo a utilização do método `.shape`.

utilize as variáveis linhas e colunas.

In [107]:
df.shape

(1000, 8)

Saber o tamanho do DataFrame é um passo importante, mas também é fundamental entender que tipo de informação ele carrega, que está armazenado nas colunas. Encontre o nome das colunas com o atributo `.columns`

In [108]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

Bom! Isso já dá uma boa visão sobre a tabela com a qual você está lidando

# Criar e apagar coluna

Bom, agora nós sabemos exatamente o tamanho e as colunas de nossa tabela. Mas você percebeu que tem colunas extra que as descritas na "descrição das colunas". Sabemos que, se os dados não tem descrição ele pode acabar alterando o sentido e o modo de fazer pesquisa, logo precisamos apagar essas colunas "inúteis" para que não ocasione isso.

Tire uma coluna que considere inútil com o `.drop()`

In [ ]:
df = df.drop(columns=["coluna"])
df

In [109]:
df = df.drop(columns=["parental level of education"])
df

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score
0,female,group B,standard,none,72,72,74
1,female,group C,standard,completed,69,90,88
2,female,group B,standard,none,90,95,93
3,male,group A,free/reduced,none,47,57,44
4,male,group C,standard,none,76,78,75
...,...,...,...,...,...,...,...
995,female,group E,standard,completed,88,99,95
996,male,group C,free/reduced,none,62,55,55
997,female,group C,free/reduced,completed,59,71,65
998,female,group D,standard,completed,68,78,77
999,female,group D,free/reduced,none,77,86,86

Você pode também acrescentar uma coluna que seja necessária para os dados, como no exemplo abaixo:

In [110]:
df['Teste'] = list(range(len(df)))
df

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score,Teste
0,female,group B,standard,none,72,72,74,0
1,female,group C,standard,completed,69,90,88,1
2,female,group B,standard,none,90,95,93,2
3,male,group A,free/reduced,none,47,57,44,3
4,male,group C,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...
995,female,group E,standard,completed,88,99,95,995
996,male,group C,free/reduced,none,62,55,55,996
997,female,group C,free/reduced,completed,59,71,65,997
998,female,group D,standard,completed,68,78,77,998
999,female,group D,free/reduced,none,77,86,86,999

O código procura a existência da coluna Teste no método `list()`, caso ela não exista ele cria gerando números que representam a posição da coluna. o `range()` significa o faça e o `len()` pega o tamanho do seu dataset

Agora é sua vez, apague a coluna Teste criada e crie uma nova que possa colaborar com o dataset que estamos utilizando

In [111]:
df = df.drop(columns=["Teste"]) # Apaga a coluna 'Teste'
df["mean score"] = round((df["math score"] + df["reading score"] + df["writing score"]) / 3, 1) # Cria uma nova coluna com a média dos estudantes e arredonda para 1 casa decimal
df

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score,mean score
0,female,group B,standard,none,72,72,74,72.7
1,female,group C,standard,completed,69,90,88,82.3
2,female,group B,standard,none,90,95,93,92.7
3,male,group A,free/reduced,none,47,57,44,49.3
4,male,group C,standard,none,76,78,75,76.3
...,...,...,...,...,...,...,...,...
995,female,group E,standard,completed,88,99,95,94.0
996,male,group C,free/reduced,none,62,55,55,57.3
997,female,group C,free/reduced,completed,59,71,65,65.0
998,female,group D,standard,completed,68,78,77,74.3
999,female,group D,free/reduced,none,77,86,86,83.0

### Descrição estatística

Ok, dimensionamos a tabela e vimos o nome das colunas, mas isso ainda é o começo, precisamos saber como manipular essa tabela. Uma forma interessante de acessar os dados da tabela é com a seguinte sintaxe:

In [112]:
variável_coluna = df["mean score"]
variável_coluna

0      72.7
1      82.3
2      92.7
3      49.3
4      76.3
       ...
995    94.0
996    57.3
997    65.0
998    74.3
999    83.0
Name: mean score, Length: 1000, dtype: float64

O que isso quer dizer? Bem, a sintaxe `df['coluna']` acessa a coluna nomeada do DataFrame df, essa coluna foi armazenada na variável_coluna e apresentada.

Ok, temos acesso às colunas do DataFrame, isso é bom, isso quer dizer que podemos tirar algumas conclusões

O método `.mean()` calcula médias em listas rapidamente, não precisamos fazer nenhuma conta, isso é no mínimo excelente.

Agora é sua vez: Calcule a média de alguma coluna numérica, se não houver, deixe-a numérica.

In [ ]:
v = df["outra_coluna"].mean()
v

In [113]:
v = df["mean score"].mean() # Que irônico agora descobrir que existe uma função para isso kkkkkkkk
v

67.7698

Excelente, fizemos uma análise interessante sobre os dados do DataFrame, porém fazer isso para todas colunas é extremamente chato. Entretanto, existe uma forma fantástica de descrever os valores em um DataFrame, teste abaixo o método `.describe()`

In [114]:
df.describe()

       math score  reading score  writing score   mean score
count  1000.00000    1000.000000    1000.000000  1000.000000
mean     66.08900      69.169000      68.054000    67.769800
std      15.16308      14.600192      15.195657    14.257197
min       0.00000      17.000000      10.000000     9.000000
25%      57.00000      59.000000      57.750000    58.300000
50%      66.00000      70.000000      69.000000    68.300000
75%      77.00000      79.000000      79.000000    77.700000
max     100.00000     100.000000     100.000000   100.000000

Note que o resultado mostra apenas as colunas com dados númericos, o que já ajuda bastante, mas seria bastante interessante analisarmos uma coluna que parece importante, pois ela pode trazer algumas informações interessantes. Vamos fazer o seguinte: Vamos pegar a coluna e aplicar a função `.value_counts()` para ver quais valores essa coluna possui. Obs: Procure colunas com poucos valores únicos, Ex: Gêneros

In [115]:
df["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

Essa é uma forma bem legal de analisar colunas de dados categóricos, mas tem um detalhe interessante: Se você somar todas quantidades acima, o resultado vai ser menor que o número de linhas.
Para isto usamos a função `.sum()`

In [116]:
df["gender"].value_counts().sum() # Aqui eu não entendi, deu 1000, tá certo isso? esse data frame (students) já está limpo?

1000

Se o número de linhas originais for menor que o número de linhas na soma, isso quer dizer que existem valores nulos na coluna. Para verificar se existem valores nulos em uma coluna, podemos usar o método `.isnull().sum()`

### Limpeza de dados

Esses valores NaN são uma pedra no sapato para os programadores, mas são facilmente tratados. Mas antes de tratarmos, vamos ver se realmente existem NaN no DataFrame.

In [117]:
df.isna().values.any()

False

In [96]:
df["gender"].isnull().sum()

0

A sequência acima faz a seguinte ação: Primeiro, aplica-se a função `.isna()`, que converte os valores do DataFrame para True caso sejam NaN e False caso não o sejam, depois o atributo `.values` retorna um array com todos esses Trues e Falses, a função `.any()` é aplicada sobre esse array e caso haja algum True (significando que existe um NaN) ele retorna True, caso contrário False.

Resumo: Retorna True se tiver pelo menos um NaN

Se existem NaNs dentro do DataFrame, vamos então tratar esse problema, vamos aplicar a função `.fillna()`.

In [97]:
df["gender"].isna().values.any()

False

Agora nós podemos utilizar o `.fillna() `para colocar atributo nas células vazias no caso.

In [98]:
df["gender"] = df["gender"].fillna("item da coluna")

Vamos testar agora se ainda existem NaN na nossa coluna.

In [99]:
df["gender"].isna().values.any()

False

Ok, antes existiam NaNs dentro da coluna "coluna", e com a função `.fillna() `inserimos o valor "valor" dentro desses NaNs e agora não existem mais NaNs na coluna. Lembrando que eu coloquei "valor" para preencher só por fins didáticos, quando preencher os valores NaNs tome cuidado com o valor que está inserindo.

Agora, se chamarmos o `.value_counts().sum()` vamos ver o que acontece:

In [100]:
df["gender"].value_counts().sum()

1000

Vamos aplicar apenas o `.value_counts()` novamente.

In [101]:
df["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

Percebeu que agora "valor" aparece mais vezes que antes, interessante não?

Bom, agora é sua vez de testar. Veja se a somatória da coluna **"coluna"** é igual ao número de linhas, após veja se possui NaN e, se possuir, coloque um valor qualquer **"valor"** como código. Depois de fazer isso, teste a somatória e veja se tem NaN para conferir se deu certo.

In [ ]:
""" Eu testei todas as colunas desse DataFrame e todas estão dando 1000, então, conversando com Felipe resolver tratar os dados de outra forma...
Ao analisar a coluna 'test preparation course' vemos dados de dois tipos: 'none' e 'completed' então irei trocar eles para False e True booleanos.

In [142]:
df['test preparation course'] = df['test preparation course'].replace({'completed': True, 'none': False})
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,False,72,72,74
1,female,group C,some college,standard,True,69,90,88
2,female,group B,master's degree,standard,False,90,95,93
3,male,group A,associate's degree,free/reduced,False,47,57,44
4,male,group C,some college,standard,False,76,78,75
5,female,group B,associate's degree,standard,False,71,83,78
6,female,group B,some college,standard,True,88,95,92
7,male,group B,some college,free/reduced,False,40,43,39
8,male,group D,high school,free/reduced,True,64,64,67
9,female,group B,high school,free/reduced,False,38,60,50

### Checando duplicadas

Não é muito importante verificar dados repetidos nesse DataFrame em específico porque é um DataFrame em que duas linhas iguais sinceramente não importam: Dois esquilos iguais podiam estar no mesmo lugar. Entretanto, em alguns DataFrames, ter linhas repetidas pode ser algo errado, nesse caso, pode ser interessante verificar as seguintes funções:

In [118]:
df.duplicated().any() # O meu tinha dado 'True' quando rodei pela primeira vez antes de dar drop.duplicates()

True

Ok, nesse DataFrame não existem duplicatas, mas caso houvesse, seria interessante aplicar a seguinte função:

In [121]:
df = df.drop_duplicates()
df

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score,mean score
0,female,group B,standard,none,72,72,74,72.7
1,female,group C,standard,completed,69,90,88,82.3
2,female,group B,standard,none,90,95,93,92.7
3,male,group A,free/reduced,none,47,57,44,49.3
4,male,group C,standard,none,76,78,75,76.3
...,...,...,...,...,...,...,...,...
995,female,group E,standard,completed,88,99,95,94.0
996,male,group C,free/reduced,none,62,55,55,57.3
997,female,group C,free/reduced,completed,59,71,65,65.0
998,female,group D,standard,completed,68,78,77,74.3
999,female,group D,free/reduced,none,77,86,86,83.0

`.drop_duplicates()` remove duplicatas e retorna um DataFrame com essas duplicatas removidas, é bem interessante considerando que alguns DataFrames podem ter informações repetidas por erro humano.

###  Renomeando Colunas

Renomear colunas em um DataFrame melhora a clareza e organização dos dados, transformando informações complexas em rótulos compreensíveis, facilitando assim a interpretação dos resultados. A biblioteca pandas do Python oferece uma função robusta para renomear colunas, permitindo personalização dos nomes para se alinhar melhor à natureza dos dados. Essa prática promove maior legibilidade, colaboração e precisão na análise dos dados.
A função do pandas que permite renomear colunas em um DataFrame é chamada `.rename()`.

In [69]:
df = df.rename(columns= {'nome': 'antigo_nome'})

In [70]:
df.head(5)

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score,mean score
0,female,group B,standard,none,72,72,74,72.7
1,female,group C,standard,completed,69,90,88,82.3
2,female,group B,standard,none,90,95,93,92.7
3,male,group A,free/reduced,none,47,57,44,49.3
4,male,group C,standard,none,76,78,75,76.3

Agora é sua vez, renomeie as colunas que você julgar necessário para a compreensão.

dica: utilize a descrição das colunas

In [4]:
df = df.rename(columns= {'race/ethnicity': 'Ethnicity'})
df = df.rename(columns= {'gender': 'Gender'})
df = df.rename(columns= {'lunch': 'LunchType'})
df = df.rename(columns= {'test preparation course': 'TestPrepCourse'})
df.head(5) 
# Troquei alguns nomes para ficar mais legível ao usuário

,Gender,Ethnicity,parental level of education,LunchType,TestPrepCourse,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

Visto o dataset, quais os dados numéricos e dados categóricos? cite 2 exemplos de cada.

mean score (pontuação média) É um exemplo de dado numérico, pois representa a média entre as notas dos estudantes nas 3 matérias do dataset.
gender (gênero): Este é um exemplo de dado categórico, já que representa duas categorias distintas, como "masculino" e "feminino".

Percebeu se o dataset tinha algum enviezamento e/ou erro? Justifique

Na coluna 'test preparation course' tinha alguns dados string 'none' o que poderia conflitar com dados nulos, caso houvesse algum dentro do dataframe, por isso resolvi trocar os valores dessa coluna para True e False booleanos